# **********************************************************************************
# Title   : ベイズ統計モデリングによるデータ分析入門
# Chapter : 3 一般化線形モデル
# Theme   : 1 一般化線形モデルの基本
# Date    : 2022/4/18
# Page    : P153 - P166
# URL     : https://logics-of-blue.com/r-stan-bayesian-model-intro-book-support/
# **********************************************************************************


# ＜概要＞
# - 一般化線形モデル(GLM)は実践的なモデルであるだけでなく複雑なモデルを構築する際の部品としても重要
# - 3つのパーツを変更していくことで状況にあったモデル構築が行えるようになる
#   --- 確率分布（観測したデータを生み出す確率的な過程）
#   --- 線形予測子（説明変数の線形結合）
#   --- リンク関数（応答変数と線形予測子を関係づける関数）

